import svgUrl from '/src/media/call.svg';

export default () => {
  return `<section class="results">
  <div class="container results-container">
    <p class="results-top-text">Ваш результат рассчитан:</p>
    <p class="results-underTop-text">
      <span>Вы относитесь к 3%</span> респондентов, чей уровень интеллекта более
      чем на 15 пунктов отличается от среднего в большую или меньшую сторону!
    </p>
    <p class="results-middle-text">Скорее получите свой результат!</p>
    <p class="results-underMiddle-text">
      В целях защиты персональных данных результат теста, их подробная
      интерпретация и рекомендации доступны в виде голосового сообщения по
      звонку с вашего мобильного телефона
    </p>
    <p class="results-bottom-text">
      Звоните скорее, запись доступна всего
      <span data-minutes>10</span><span>:</span><span data-seconds>00</span> минут
    </p>
    <button type='button' class="results-btn"
      ><img src="${svgUrl}" alt="call" width="30" height="30" /><span
        class="results-link-text"
        >Позвонить и прослушать результат
      </span></button
    >
    <div class="response-container"></div>
    <p class='footer-text'>TERMENI SI CONDITII: ACESTA ESTE UN SERVICIU DE DIVERTISMENT. PRIN FOLOSIREA LUI DECLARATI CA AVETI 18 ANI IMPLINITI,</p>
  </div>
  <div class="loader-results-wrapper">
 <svg class='loader-results-image' viewBox="0 0 30 32">
<path fill="#3bde7c" style="fill: var(--color1, #3bde7c)" d="M13.909 6.939c0 0 0.001 0 0.001 0 1.917 0 3.47-1.553 3.471-3.47v-0c-0.001-1.916-1.554-3.469-3.471-3.469-0.001 0-0.001 0-0.001 0h0c-0 0-0.001 0-0.001 0-1.916 0-3.47 1.553-3.471 3.469v0c0.001 1.917 1.554 3.47 3.471 3.47 0.001 0 0.001 0 0.001 0h-0zM20.71 8.486c1.744 0 3.158-1.413 3.158-3.155s-1.414-3.155-3.157-3.155c-0 0-0.001 0-0.001 0h0c-0 0-0.001 0-0.001 0-1.743 0-3.156 1.413-3.157 3.155v0c0.001 1.743 1.414 3.155 3.157 3.155 0 0 0.001 0 0.001 0h-0zM25.615 13.237c0 0 0.001 0 0.001 0 1.568 0 2.84-1.271 2.841-2.84v-0c-0.001-1.568-1.272-2.84-2.841-2.84-0 0-0.001 0-0.001 0h0c-0 0-0.001 0-0.001 0-1.568 0-2.84 1.271-2.841 2.84v0c0.001 1.568 1.272 2.84 2.841 2.84 0 0 0.001 0 0.001 0h-0zM29.74 17.662c0.021-0.121 0.033-0.261 0.033-0.404 0-1.252-0.911-2.29-2.106-2.489l-0.015-0.002c-0.126-0.022-0.271-0.035-0.42-0.035-1.394 0-2.524 1.13-2.524 2.524 0 1.256 0.918 2.298 2.12 2.492l0.014 0.002c0.122 0.021 0.262 0.033 0.405 0.033 1.251 0 2.29-0.91 2.49-2.105l0.002-0.015zM25.153 26.194c0 0 0.001 0 0.001 0 1.219 0 2.208-0.988 2.208-2.207v-0c0-1.22-0.989-2.208-2.209-2.208-0 0-0.001 0-0.001 0-1.219 0-2.208 0.988-2.208 2.207v0c0 1.22 0.989 2.208 2.209 2.208zM19.918 30.605c0 0 0 0 0 0 1.046 0 1.894-0.848 1.895-1.894v-0c-0.001-1.046-0.849-1.894-1.895-1.894-0 0-0 0-0 0h0c-0 0-0.001 0-0.001 0-1.046 0-1.894 0.848-1.895 1.893v0c0 1.046 0.848 1.894 1.895 1.894 0 0 0.001 0 0.001 0h-0zM13.005 31.686c0 0 0.001 0 0.001 0 0.871 0 1.578-0.706 1.578-1.578v-0c-0-0.871-0.707-1.578-1.578-1.578-0 0-0.001 0-0.001 0h0c-0 0-0.001 0-0.001 0-0.871 0-1.578 0.706-1.578 1.578v0c0 0.871 0.707 1.578 1.578 1.578 0 0 0.001 0 0.001 0h-0zM6.343 29.052c0.697 0 1.262-0.565 1.262-1.262s-0.565-1.262-1.262-1.262c-0.697 0-1.262 0.565-1.262 1.262 0 0 0 0.001 0 0.001v-0c0 0.697 0.565 1.261 1.263 1.261zM1.794 23.349c0 0 0 0 0 0 0.523 0 0.946-0.424 0.946-0.946s-0.424-0.946-0.946-0.946v0c-0 0-0 0-0 0-0.522 0-0.946 0.424-0.946 0.946s0.423 0.946 0.946 0.946v0zM0.632 16.083c0 0 0 0 0 0 0.349 0 0.632-0.283 0.632-0.632s-0.283-0.632-0.632-0.632v0c-0.349 0-0.632 0.283-0.632 0.632s0.283 0.632 0.632 0.632v0zM3.178 9.193c-0.005 0-0.010 0-0.015 0-0.175 0-0.316-0.142-0.316-0.316s0.142-0.316 0.316-0.316c0.003 0 0.006 0 0.008 0h-0c0.171 0.004 0.308 0.144 0.308 0.316 0 0.169-0.133 0.308-0.3 0.316l-0.001 0z"></path>
</svg>
</div>
</section>`;
};
